import UIKit

// Задание 1. Решить квадратное уравнение.

let a : Double = 2
let b : Double = 4
let c : Double = 2

print("Задание 1. Решить квадратное уравнение вида \(a)x^2 + (\(b))x + \(c) = 0.")

let D : Double = pow(b, 2) - 4*a*c
print ("Найдем дискриминант квадратного уравнения: \(D)")

if D < 0 {
    print("Так как дискриминант меньше нуля, то уравнение не имеет действительных решений.")
}
else if D == 0 {
    let x = -b/(2*a)
    print ("Так как дискриминант равен нулю то, квадратное уравнение имеет один действительный корень: X=\(x)")
} else {
    let x1 = (-b-sqrt(D))/(2*a)
    let x2 = (-b+sqrt(D))/(2*a)
    print("Так как дискриминант больше нуля то, квадратное уравнение имеет два действительных корня: X1=\(x1) , X2=\(x2)")
}


// Задание 2. Даны катеты прямоугольного треугольника. Найти площадь, периметр и гипотенузу треугольника.
let leg1 : Double = 8
let leg2 : Double = 12
print ("\nЗадание 2. Даны катеты прямоугольного треугольника (a = \(leg1), b = \(leg2)). Найти площадь, периметр и гипотенузу треугольника.")

let hypotenuse : Double = sqrt(pow(leg1, 2) + pow(leg2, 2))
print ("В прямоугольном треугольнике гипотенуза равна корню из сумм квадратов катетов. √(\(leg1)^2 + \(leg2)^2) = \(hypotenuse)")

let S : Double = leg1 * leg2 / 2
print ("Площадь прямоугольного треугольника равна половине произведения двух катетов. \(leg1) * \(leg2) / 2 = \(S)")

let P = leg1 + leg2 + hypotenuse
print ("Периметр прямоугольного треугольника равен сумме длин всех сторон. \(leg1) + \(leg2) + \(hypotenuse) = \(P)")

//Задание 3. Пользователь вводит сумму вклада в банк и годовой процент. Найти сумму вклада через 5 лет.
let percent : Double = 10
let money : Double = 100000
let timeInYears = 5
print("\nЗадание 3. Пользователь вкладывает сумму размером \(money) сроком на \(timeInYears) под \(percent)% годовых.")
var result = money
for _ in 0..<timeInYears {
    result += result*percent/100
}
print("Сумма вклада через \(timeInYears) равна \(result)")

result = money * pow((Double(1) + (percent/100)), Double(timeInYears))
print("Также результат можно вычислить по частной формуле для годовой капитализации (процент начисляется ежегодно) : \(money) * (1 + \(percent)/100)^\(timeInYears) = \(result)")

